Lai1207/STM32/10-1_software_i2c_mpu6050/Hardware/Mpu6050.c
#include "stm32f10x.h"                  // Device header
#include "Myi2c.h"
#include "Mpu6050_Reg.h"

#define MPU6050_ADDRESS 0xD0




void Mpu6050_WriteReg(uint8_t RegAddress,uint8_t Data){
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(Data);
	MyI2C_ReceiveAck();
	MyI2C_Stop();
}
uint8_t Mpu6050_ReadReg(uint8_t RegAddress){
	uint8_t Data = 0x00;
	
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS | 0x01);
	MyI2C_ReceiveAck();
	Data = MyI2C_ReceiveByte();
	MyI2C_SendAck(1);
	MyI2C_Stop();
	
	return Data;
}
void Mpu6050_Init(){
	Myi2c_Init();
	Mpu6050_WriteReg(MPU6050_PWR_MGMT_1, 0x01);
	Mpu6050_WriteReg(MPU6050_PWR_MGMT_2, 0x00);
	Mpu6050_WriteReg(MPU6050_SMPLRT_DIV, 0x09);
	Mpu6050_WriteReg(MPU6050_CONFIG, 0x06);
	Mpu6050_WriteReg(MPU6050_GYRO_CONFIG, 0x18);
	Mpu6050_WriteReg(MPU6050_ACCEL_CONFIG, 0x18);
}
void Mpu6050_GatData(int16_t *AccX, int16_t *AccY, int16_t *AccZ, int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ){
	
	uint8_t DataH, DataL;
	DataH = Mpu6050_ReadReg(MPU6050_ACCEL_XOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_ACCEL_XOUT_L);
	*AccX = (DataH << 8) | DataL;
	
	DataH = Mpu6050_ReadReg(MPU6050_ACCEL_YOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_ACCEL_YOUT_L);
	*AccY = (DataH << 8) | DataL;
	
	DataH = Mpu6050_ReadReg(MPU6050_ACCEL_ZOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_ACCEL_ZOUT_L);
	*AccZ = (DataH << 8) | DataL;
	
	DataH = Mpu6050_ReadReg(MPU6050_GYRO_XOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_GYRO_XOUT_L);
	*GyroX = (DataH << 8) | DataL;
	
	DataH = Mpu6050_ReadReg(MPU6050_GYRO_YOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_GYRO_YOUT_L);
	*GyroY = (DataH << 8) | DataL;
	
	DataH = Mpu6050_ReadReg(MPU6050_GYRO_ZOUT_H);
	DataL = Mpu6050_ReadReg(MPU6050_GYRO_ZOUT_L);
	*GyroZ = (DataH << 8) | DataL;
	
}
uint8_t Mpu6050_GetID(void){
	return Mpu6050_ReadReg(MPU6050_WHO_AM_I);
}
